<a href="https://colab.research.google.com/github/Ainy07/python-programs/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
#Make a Pandas DataFrame with a two-dimensional list | Python
import pandas as pd
data = [
    [1 , "Ainy" , 25],
    [2 , 'himanshu' , 29],
    [3 , "aaishi" , 24]
]
dt = pd.DataFrame(data , columns=["id" , "Name" , "Age"])
print(dt)

   id      Name  Age
0   1      Ainy   25
1   2  himanshu   29
2   3    aaishi   24

In [20]:
dt["Country"] = "India"
print(dt)

   id      Name  Age Country
0   1      Ainy   25   India
1   2  himanshu   29   India
2   3    aaishi   24   India

In [21]:
dt['City'] = ['Delhi', 'Mumbai', 'Pune']
print(dt)

   id      Name  Age Country    City
0   1      Ainy   25   India   Delhi
1   2  himanshu   29   India  Mumbai
2   3    aaishi   24   India    Pune

In [22]:
dt.loc[len(dt)] = [4, 'David', 28, 'Bangalore', 'India']
print(dt)

   id      Name  Age    Country    City
0   1      Ainy   25      India   Delhi
1   2  himanshu   29      India  Mumbai
2   3    aaishi   24      India    Pune
3   4     David   28  Bangalore   India

In [23]:
dt["Age Group"] = dt["Age"].apply(lambda x : "Young" if x < 26 else "Adult")
print(dt)

   id      Name  Age    Country    City Age Group
0   1      Ainy   25      India   Delhi     Young
1   2  himanshu   29      India  Mumbai     Adult
2   3    aaishi   24      India    Pune     Young
3   4     David   28  Bangalore   India     Adult

In [24]:
dt = dt.drop(1)
print(dt)

   id    Name  Age    Country   City Age Group
0   1    Ainy   25      India  Delhi     Young
2   3  aaishi   24      India   Pune     Young
3   4   David   28  Bangalore  India     Adult

In [25]:
dt= dt[dt['Age'] > 26]
print(dt)

   id   Name  Age    Country   City Age Group
3   4  David   28  Bangalore  India     Adult

In [26]:
dt = dt.reset_index(drop=True)
print(dt)

   id   Name  Age    Country   City Age Group
0   4  David   28  Bangalore  India     Adult

In [28]:
dt = dt.drop(['Age Group'], axis=1)

print(dt)

   id   Name  Age    Country   City
0   4  David   28  Bangalore  India

In [29]:
dt.loc[0, "Age"] = 26
print(dt)

   id   Name  Age    Country   City
0   4  David   26  Bangalore  India

In [3]:
#Python | Creating DataFrame from dict of narray/lists
import pandas as pd
data = {
    'Name': ['Ainy', 'Riya', 'Sohan', 'Amit'],
    'Age': [22, 24, 21, 23],
    'City': ['Delhi', 'Mumbai', 'Pune', 'Chennai']
}
df = pd.DataFrame(data)
print(df)

    Name  Age     City
0   Ainy   22    Delhi
1   Riya   24   Mumbai
2  Sohan   21     Pune
3   Amit   23  Chennai

In [11]:
print(len(df))

3

In [12]:
df["Salary"] = [20000, 25000, 30000]
print(df)

       A   B   C  Salary
Row1  10  40  70   20000
Row2  20  50  80   25000
Row3  30  60  90   30000

In [4]:
#Using NumPy Arrays
import pandas as pd
import numpy as np

data = {
    "A" : np.array([10,20,30]),
    "B" : np.array([40,50,60]),
    "C" : np.array([70,80,90]),
}
df = pd.DataFrame(data)
print(df)

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [5]:
df = pd.DataFrame(data , index = ["Row1" , "Row2", "Row3"])
print(df)

       A   B   C
Row1  10  40  70
Row2  20  50  80
Row3  30  60  90